{"pageProps":{"frontmatter":{"title":"Basic Understanding of Stable Diffusion(No Maths)","slug":"23-10-16-stable-diffusion-basic-understanding","description":"This is a basic blog on understanding stable diffusion without any math or deep understanding of computer vision.","date":"16 Oct 2023","tags":["AI","Computer Vision","Diffusion"],"cover_image":"23-10-16-stable-diffusion-basic-understanding/hero-noise.png"},"content":"<p>This is a basic blog on understanding stable diffusion without any math or deep understanding of computer vision.</p>\n<p>If you want to read the code for stable diffusion, I have written it here : <a href=\"https://github.com/anshuman-8/PyTorch-Latent-Diffusion\">PyTorch Latent Diffusion</a></p>\n<p>In short, how stable diffusion works is that we start with noise (a random image) and use a U-Net model to predict and remove noise from the noise in steps. We also use a self-attention mechanism and a CLIP model (more about it later) to make the image more towards the prompt.</p>\n<p>Let’s dig a bit deeper in the diffusion model.</p>\n<h3>Pure Diffusion model</h3>\n<p>Lets start with, what is a pure diffusion model?</p>\n<p>A Diffusion model can be seen in two parts, Forward diffusion and a reverse diffusion process.</p>\n<p>In the forward diffusion model, we add noise to an image in steps. In reverse diffusion we remove the noise from a sample and generate an image.</p>\n<p>The paper which defined the process of adding noise and then denoising is given in - Denoising diffusion probabilistic models  (<a href=\"https://arxiv.org/pdf/2006.11239.pdf\">arxiv.org/pdf/2006.11239.pdf</a>)</p>\n<p><img src=\"/blog-assets/23-10-16-stable-diffusion-basic-understanding/diffusion.png\" alt=\"Pure Diffusion\"></p>\n<h3>Training Process</h3>\n<p>For the forward process of stable diffusion we add gaussian noise from steps 1 to 1000, where 1st is the real image sample and sample 1000 is a complete noise. We can do this by using the normal distribution defined in the paper (No Maths!).</p>\n<p>For the reverse diffusion we train a U-Net model to predict the noise. We pass the noisy image along with time step positional encoding. Like if I pass the image from step x_50 to predict the image with step x_49, where 50 and 40 are the time steps, I also pass along the positional encoding (will talk about it later) of the image in the U-Net .</p>\n<h3>The Problem</h3>\n<p>The problem with the above steps is that running a pure diffusion model directly on an image takes a lot of computation and has a lot of parameters to learn. A single image of size 512 has a 3x512x512 number of values.</p>\n<p>So the solution to this problem was solved in the paper - High-Resolution Image Synthesis with Latent Diffusion Models. Here they have used a Variational autoencoder to bring down the image to a latent space. The dimensions of latent space is 4x64x64, benefits of this are that we have to learn very less number of parameters, and a special thing about variational autoencoders is that they give similar encoding to images that are similar.</p>\n<h3>Latent Diffusion Model</h3>\n<p>Paper : <a href=\"https://arxiv.org/pdf/2112.10752.pdf\">arxiv.org/pdf/2112.10752.pdf</a></p>\n<p>Latent Diffusion is also called the Stable diffusion model. As told before, to improve the training process the image is first made into a latent using a variational auto encoder and the diffusion process adds noise to its latent space. Later, we also use a decoder to get back the image from the latent space.</p>\n<p>But, to make a text-to-image model where you can direct the image generation, we use conditioning, which is a process of steering the noise prediction so that after the noise subtraction we get our desired results.</p>\n<p>So the whole stable diffusion process can be divided into 4 different parts -</p>\n<ul>\n<li>Variational Autoencoder Model</li>\n<li>CLIP Model</li>\n<li>U-Net noise prediction model</li>\n<li>Scheduler</li>\n</ul>\n<p>Lets discuss few of them.</p>\n<p><img src=\"/blog-assets/23-10-16-stable-diffusion-basic-understanding/stable-diffusion.png\" alt=\"stable-diffusion\">\nThe above diagram is from the paper High-Resolution Image Synthesis with Latent Diffusion Models arXiv:2112.10752v2</p>\n<h3>Variational Autoencoder</h3>\n<p>Autoencoders are neural networks used for dimensionality reduction. It takes an image and reduces it to a encoded data with fewer number of features. This makes the training faster as the number of parameters required is less for image in encoded space or latent space.</p>\n<p>But, just autoencoders are not enough for content generation. This is because the encoded space generated is not regular enough for the same image type. Therefore, we use Variational Autoencoder.</p>\n<p>Also, instead of encoding an image as a single point in a space, we encode it as a distribution over the latent space. Which means similar images will have close encoding.</p>\n<p>This can also be divided into two parts: one is a Variational encoder which makes an image into a latent space, and then the other is Decoder which gets back the image from the latent space.</p>\n<p>For more read refer - <a href=\"https://towardsdatascience.com/understanding-variational-autoencoders-vaes-f70510919f73\">Understanding-variational-autoencoders-vaes-f70510919f73</a></p>\n<h3>CLIP Model</h3>\n<p>CLIP stands for Contrastive Language-Image Pre-Training, which is a model first trained my OpenAI. In stable diffusion the CLIP is used for conditioning, i.e. generate images as given in the prompt. It is also like the variational encoder which brings down the dimentions into a meaningful encoding.</p>\n<p>After passing the prompt, we tokenize it which breaks the sentences into tokens and assign a vector to each token. This are then passed through the CLIP embedding which gives out an embedding or context which can be used my the U-Net.</p>\n<h3>U-Net Model</h3>\n<p>This is the most important part of whole stable diffusion, here we do the noise prediction on an image. The latent space from the variational autoencoder is passed through the U-Net along with the context from the CLIP model and timestep from scheduler.</p>\n<p>This is very similar to the original U-Net, only difference is the input.output channel and the use of attention blocks(more about in other blog) between the residual blocks. The attention blocks do the self attention and  cross attention using the image sample and the prompt context, this conditions the U-Net to predict noise for desired results.</p>\n<p>Read this for basic U-Net understanding -  <a href=\"https://towardsdatascience.com/unet-line-by-line-explanation-9b191c76baf5\">https://towardsdatascience.com/unet-line-by-line-explanation-9b191c76baf5</a></p>\n<p>This is how Stable diffusion model works in general.</p>\n"},"__N_SSG":true}